# Задача 6
# Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали 
# билет с номером. Счастливым билетом называют такой билет с шестизначным номером, где сумма 
# первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, т.к. 
# 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.
# Пример:
# 385916 -> yes
# 123456 -> no


def Sum(ticketPart):
    sum = 0
    while ticketPart > 0:
        sum += ticketPart % 10
        ticketPart //= 10
    return sum

tiсket = int(input('Введите шестизначный номер билета '))
leftPartTicket = tiсket // 1000
rightPartTicket = tiсket % 1000

if Sum(leftPartTicket) == Sum(rightPartTicket):
    print('Yes')
else:
    print('No')
